"""
Имя проекта: №21
Номер версии: 1.0
Имя файла: practicum-1(№21).py
Автор: 2020 © Н.Д.Кислицын, Челябинск
Лицензия использования:  CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 22/11/2020
Дата последней модификации: 22/11/2020
Связанные файлы/пакеты: 
Описание: Решение задач № 21 практикума № 1
#версия Python: 3.6
"""

"""
Оригинал публикации: Практикум №1 - набиваем руку (Бизнес-информатика 2020)
"""

x = int(input("Введите Х:"))
y = int(input("Введите У:"))
z = 1 / (x*y)
print("Значение функции равно",z)
