"""
Имя проекта: practicum-1
Номер версии: 1.0
Имя файла: practicum-1(№4).py
Автор: 2020 © Н.К. Кислицын, Челябинск
Лицензия использования:  CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 15/11/2020
Дата последней модификации: 15/11/2020
Связанные файлы/пакеты: 
Описание: Решение задачи № 4 практикума № 1
#версия Python: 3.6
"""

"""
Оригинал публикации: Практикум №1 - набиваем руку (Бизнес-информатика 2020)
"""

p=1000
kg=(p)/1000
t=(p)/1000000
print(kg)
print(t)
