"""
Имя проекта: practicum-1
Номер версии: 1.0
Имя файла: practicum-1(№5).py
Автор: 2020 © Н.К. Кислицын, Челябинск
Лицензия использования:  CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 15/11/2020
Дата последней модификации: 11/11/2020
Оригинал публикации: Практикум №1 — набиваем руку | Бизнес-информатика 2020
Описание: Решение задачи № 5 практикума № 1
#версия Python: 3.6
"""

"""
Оригинал публикации: Практикум №1 - набиваем руку (Бизнес-информатика 2020)
"""

b = 256
klb = float (b) / float (1024)
mgb = float (klb) / float (1024)
print (klb)
print (mgb)
