"""
Имя проекта: praktikum_1
Номер версии: 1.0
Имя файла: practicum-1(№6).py
Автор: 2020 © Н.Д.Кислицын, Челябинск
Лицензия использования:  CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 15/11/2020
Дата последней модификации: 15/11/2020
определить значение функции Z = 1/(XY)
Описание: Решение задач №№ 1-7 практикума № 3
#версия Python: 3.6
"""

"""
Оригинал публикации: Практикум №1 - набиваем руку (Бизнес-информатика 2020)
"""

X = 1
Y = 0
if X != 0 and Y != 0:
    Z = 1 / (X * Y)
    print(Z)
else:
    print("неопределенность")
